Tekla Open API Reference for Tekla Structures 2025
DetailMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DetailName
Returns the detail name property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.DetailMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace